{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "embedding_size": 768,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\uacf5\ud3ec",
    "1": "\ub180\ub78c",
    "2": "\ubd84\ub178",
    "3": "\uc2ac\ud514",
    "4": "\uc911\ub9bd",
    "5": "\ud589\ubcf5",
    "6": "\ud610\uc624"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uacf5\ud3ec": 0,
    "\ub180\ub78c": 1,
    "\ubd84\ub178": 2,
    "\uc2ac\ud514": 3,
    "\uc911\ub9bd": 4,
    "\ud589\ubcf5": 5,
    "\ud610\uc624": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 42000
}
